In [2]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\ompra\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\ompra\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ompra\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ompra\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ompra\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\ompra\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [1]:
import pandas as pd
df=pd.read_csv('data.csv')
# df=pd.read_csv('data.csv',index_col=0)  this will set the first column as index
df

   Unnamed: 0.1  Unnamed: 0  sn name  age        add
0             0           0   1  Ram   34  Kathmandu

In [ ]:
df=pd.read_csv('data.csv',usecols=[0,1,2,3]) # 0,1,2,3 are the column numbers
df.head(5)  # to display the first five rows
# df.head(2)   # to display the first two rows

    name  age        add       phone
0    Ram   34  Kathmandu  9808774567
1  Shyam   45   Lalitpur  9808334678
2   Hari   45  Bhaktapur  9808667864
3  Nabin   67      Jhapa  9808667654
4   Sita   34  Kathmandu  9870667624

In [9]:
df.tail(2)   # to display the last two rows

   name  age        add       phone
4  Sita   34  Kathmandu  9870667624
5  Soni   22      Jhapa  9808334894

In [10]:
df.sample(2)  # to display two random rows

    name  age        add       phone
3  Nabin   67      Jhapa  9808667654
2   Hari   45  Bhaktapur  9808667864

In [11]:

row,col=df.shape
print(row)
print(col)

6
4

In [47]:
df=pd.read_csv('data.csv')
df[['name','age','add']]

    name  age        add
0    Ram   34  Kathmandu
1  Shyam   45   Lalitpur
2   Hari   45  Bhaktapur
3  Nabin   67      Jhapa
4   Sita   34  Kathmandu
5   Soni   22      Jhapa

In [12]:
df=pd.read_csv('data.csv')
df.iloc[0:3]   # to display the first three rows

    name  age        add       phone
0    Ram   34  Kathmandu  9808774567
1  Shyam   45   Lalitpur  9808334678
2   Hari   45  Bhaktapur  9808667864

In [13]:
df.iloc[0:4,0:3]   # to display the first four rows and first three columns

    name  age        add
0    Ram   34  Kathmandu
1  Shyam   45   Lalitpur
2   Hari   45  Bhaktapur
3  Nabin   67      Jhapa

In [ ]:
df[df['add']=='Kathmandu']  # to display the rows where add is Kathmandu

   name  age        add       phone
0   Ram   34  Kathmandu  9808774567
4  Sita   34  Kathmandu  9870667624

In [15]:
df[ (df['add']=='Kathmandu') | (df['age']<50) ] # to display the rows where add is Kathmandu or age is less than 50

    name  age        add       phone
0    Ram   34  Kathmandu  9808774567
1  Shyam   45   Lalitpur  9808334678
2   Hari   45  Bhaktapur  9808667864
4   Sita   34  Kathmandu  9870667624
5   Soni   22      Jhapa  9808334894